# Adult Pandas

Welcome to the advanced Pandas course! 

- First, we're going to look at pivoting and visualizing our beer sales data. That will mark the end of our long and arduous journey with the beer dataset!
- Moving onto alternative datasets, we'll take a look at indexing and combining datasets. 

## Getting Started

Let's begin with the basics.

In [59]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [60]:
df = pd.read_csv('Beer Sales.csv')

In [61]:
df.head()

         Date    Sales
0  2010-06-01   9150.0
1  2010-06-20  10084.0
2  2010-07-12   9242.0
3  2010-07-28  10361.0
4  2010-08-03   8829.0

In [62]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    35 non-null     object
 1   Sales   35 non-null     float64
dtypes: float64(1), object(1)
memory usage: 688.0+ bytes

## Analysis

We ended our last course by stating that a better alternative to the continuous time series would be to plot a separate line for each year. In other words, perform a Year Over Year (YOY) analysis for the data that is available to us.

### 1. Obtain desired columns
- We're going to do this by first converting our _Date_ field into a `datetime` object.
- Next, we'll extract the day, month and year from our _Date_.
- Finally, we'll concatenate the _Day_ and _Month_ columns so that we can eventually plot these on the X-axis of our time series.

In [63]:
df['Date'] = pd.to_datetime(df['Date'])

#### Strftime()
Extracting the day, month and year from a `datetime` field is done using the `strftime()` method. It converts a given datetime into a `string` type based on an explicit format string. 

An explicit format string is just a fancy way of saying what exactly we're looking to extract, identified by a pattern. This is a compulsory argument that the method takes. 

Pattern | Meaning | Example
--- | --- | ---
%d | Day of the month as a zero-padded decimal number. | 30
%b | Month as locale’s abbreviated name. | Sep
%B | Month as locale’s full name. | September
%m | Month as a zero-padded decimal number. | 09
%y | Year without century as a zero-padded decimal number. | 13
%Y | Year with century as a decimal number. | 2013

These patterns are familiar since we've already seen them in the previous course!

**Note**: When used on a Pandas series, the way we have below, we prefix the `strftime()` method with the attribute `dt` like such -> `dt.strftime()`. You can read more about the method [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.dt.strftime.html).

In [64]:
df['Year'] = df['Date'].dt.strftime('%Y')
df['Month'] = df['Date'].dt.strftime('%m')
df['Day'] = df['Date'].dt.strftime('%d')

#### Row-wise concatenation

As also seen in the previous course, we perform a row-wise concatenation on the _Month_ and _Day_ columns to get our desired _MonthDay_ column in the format mm/dd.

In [68]:
df['MonthDay'] = df['Month'] + '/' + df['Day']
df

         Date    Sales  Year Month Day MonthDay
0  2010-06-01   9150.0  2010    06  01    06/01
1  2010-06-20  10084.0  2010    06  20    06/20
2  2010-07-12   9242.0  2010    07  12    07/12
3  2010-07-28  10361.0  2010    07  28    07/28
4  2010-08-03   8829.0  2010    08  03    08/03
5  2010-08-16   9253.0  2010    08  16    08/16
6  2010-08-29  10713.0  2010    08  29    08/29
7  2010-09-02  10689.0  2010    09  02    09/02
8  2010-09-19   8884.0  2010    09  19    09/19
9  2010-10-05   9155.0  2010    10  05    10/05
10 2011-06-01  10369.0  2011    06  01    06/01
11 2011-06-20  10299.5  2011    06  20    06/20
12 2011-07-12   9628.0  2011    07  12    07/12
13 2011-07-28   8735.0  2011    07  28    07/28
14 2011-08-03   9840.0  2011    08  03    08/03
15 2011-08-16  10246.0  2011    08  16    08/16
16 2011-09-02  10240.0  2011    09  02    09/02
17 2011-09-19   9914.0  2011    09  19    09/19
18 2011-10-05  10288.0  2011    10  05    10/05
19 2012-06-01   9445.0  2012    06  01    06/01
20 2012-06-20   9088.0  2012    06  20    06/20
21 2012-07-12  10169.0  2012    07  12    07/12
22 2012-07-28  10412.0  2012    07  28    07/28
23 2012-08-03  10065.0  2012    08  03    08/03
24 2012-08-16  10262.0  2012    08  16    08/16
25 2012-09-02   9625.0  2012    09  02    09/02
26 2012-09-19   9412.0  2012    09  19    09/19
27 2012-10-05   9840.0  2012    10  05    10/05
28 2013-06-01   9293.0  2013    06  01    06/01
29 2013-06-20  10124.0  2013    06  20    06/20
30 2013-07-12  10215.0  2013    07  12    07/12
31 2013-08-03  10312.0  2013    08  03    08/03
32 2013-08-16   9719.0  2013    08  16    08/16
33 2013-09-02   9370.0  2013    09  02    09/02
34 2013-10-05   9976.0  2013    10  05    10/05

### 2. Create a Pivot Table

Just like Excel, Pandas offers us the capability to create pivot tables from our data. Since we're interested in looking at the sales for every year separately, we break out our DataFrame to do just that! 

The `pivot_table()` method takes the following four arguments, among others:
- the data that we want to pivot
- the index values of the pivot table
- the columns of the pivot table
- the values that we want to see inside the pivot table 

Read more about the method [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.pivot_table.html).

In [70]:
piv = pd.pivot_table(df, index=['MonthDay'], columns=['Year'], values=['Sales'])
piv

            Sales
Year         2010     2011     2012     2013
MonthDay
06/01      9150.0  10369.0   9445.0   9293.0
06/20     10084.0  10299.5   9088.0  10124.0
07/12      9242.0   9628.0  10169.0  10215.0
07/28     10361.0   8735.0  10412.0      NaN
08/03      8829.0   9840.0  10065.0  10312.0
08/16      9253.0  10246.0  10262.0   9719.0
08/29     10713.0      NaN      NaN      NaN
09/02     10689.0  10240.0   9625.0   9370.0
09/19      8884.0   9914.0   9412.0      NaN
10/05      9155.0  10288.0   9840.0   9976.0

> - Don't let Pandas' simplicity fool you! It offers extensive capabilities when it comes to reshaping data. Outside of pivot tables, Pandas can help you [pivot](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.pivot.html), [stack](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.stack.html), [unstack](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.unstack.html) and [melt](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.melt.html) your DataFrames too! These concepts are for you to explore!